// Эта функция будет жить здесь, и мы сможем импортировать ее где угодно

const transliterate = (text) => {
  if (!text) return '';
  const a = {"Ё":"YO","Й":"I","Ц":"TS","У":"U","К":"K","Е":"E","Н":"N","Г":"G","Ш":"SH","Щ":"SCH","З":"Z","Х":"H","Ъ":"","ё":"yo","й":"i","ц":"ts","у":"u","к":"k","е":"e","н":"n","г":"g","ш":"sh","щ":"sch","з":"z","х":"h","ъ":"","Ф":"F","Ы":"I","В":"V","А":"A","П":"P","Р":"R","О":"O","Л":"L","Д":"D","Ж":"ZH","Э":"E","ф":"f","ы":"i","в":"v","а":"a","п":"p","р":"r","о":"o","л":"l","д":"d","ж":"zh","э":"e","Я":"Ya","Ч":"CH","С":"S","М":"M","И":"I","Т":"T","Ь":"","Б":"B","Ю":"YU","я":"ya","ч":"ch","с":"s","м":"m","и":"i","т":"t","ь":"","б":"b","ю":"yu"};
  
  return text.split('').map(char => a[char] || char).join('')
    .toLowerCase()
    .replace(/\s+/g, '-')       // заменяем пробелы на дефисы
    .replace(/[^a-z0-9-]/g, ''); // убираем все, что не буквы, цифры или дефис
};

// Экспортируем функцию, чтобы ее можно было импортировать в других файлах
export default transliterate;